In [68]:
import pandas as pd
import numpy as np

In [70]:
sozlukVerisi={"İstanbul":[30,29,np.nan],"Ankara":[20,np.nan,25],"Izmir":[40,39,38]}
havaDurumuDataFrame=pd.DataFrame(sozlukVerisi)

In [72]:
havaDurumuDataFrame

   İstanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [74]:
havaDurumuDataFrame.dropna()

   İstanbul  Ankara  Izmir
0      30.0    20.0     40

In [76]:
havaDurumuDataFrame

   İstanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [78]:
havaDurumuDataFrame.dropna(axis=1)

   Izmir
0     40
1     39
2     38

In [80]:
yeniVeri={"İstanbul":[30,29,np.nan],"Ankara":[20,np.nan,25],"Izmir":[40,39,38],"Antalya":[45,np.nan,np.nan]}
yeniDataFrame=pd.DataFrame(yeniVeri)

In [82]:
yeniDataFrame

   İstanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [84]:
yeniDataFrame.dropna(axis=1,thresh=2) #thresh belirttiğimiz sayıdaki boş sütunları siliyor

   İstanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [86]:
yeniDataFrame

   İstanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [88]:
yeniDataFrame.fillna(20)

   İstanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0    20.0     39     20.0
2      20.0    25.0     38     20.0

## groupby

In [91]:
maasSozlugu={"Departman":["Yazılım","Yazılım","Pazarlama","Pazarlama","Hukuk","Hukuk"],
            "Calışan Ismi":["Ahmet","Mehmet","Atil","Burak","Zeynep","Fatma"],
            "Maas":[100,150,200,300,400,500]}

In [93]:
maasDataFrame=pd.DataFrame(maasSozlugu)

In [95]:
maasDataFrame

   Departman Calışan Ismi  Maas
0    Yazılım        Ahmet   100
1    Yazılım       Mehmet   150
2  Pazarlama         Atil   200
3  Pazarlama        Burak   300
4      Hukuk       Zeynep   400
5      Hukuk        Fatma   500

In [97]:
grupObjesi=maasDataFrame.groupby("Departman")

In [99]:
grupObjesi.count()

           Calışan Ismi  Maas
Departman
Hukuk                 2     2
Pazarlama             2     2
Yazılım               2     2

In [101]:
grupObjesi.max()

          Calışan Ismi  Maas
Departman
Hukuk           Zeynep   500
Pazarlama        Burak   300
Yazılım         Mehmet   150

In [103]:
grupObjesi.min()

          Calışan Ismi  Maas
Departman
Hukuk            Fatma   400
Pazarlama         Atil   200
Yazılım          Ahmet   100

In [105]:
grupObjesi.describe()

           Maas
          count   mean        std    min    25%    50%    75%    max
Departman
Hukuk       2.0  450.0  70.710678  400.0  425.0  450.0  475.0  500.0
Pazarlama   2.0  250.0  70.710678  200.0  225.0  250.0  275.0  300.0
Yazılım     2.0  125.0  35.355339  100.0  112.5  125.0  137.5  150.0